Tekla.Structures.Model.UI.ModelObjectSelector
The ModelObjectSelector class can be used to select objects from the Tekla Structures user interface.
Currently, these selections both select the objects from the database and highlight them visually.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model Model = new Model();
Beam B = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam B1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam B2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
B.Insert();
B1.Insert();
B2.Insert();
ArrayList ObjectsToSelect = new ArrayList();
ObjectsToSelect.Add(B);
ObjectsToSelect.Add(B2);
Tekla.Structures.Model.UI.ModelObjectSelector MS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MS.Select(ObjectsToSelect);
Model.CommitChanges();
}
}

Tekla.Structures.Model.UI.ModelObjectSelector.SELECT_MAX_SIZE
Maximum amount of elements in one function call

Tekla.Structures.Model.UI.ModelObjectSelector.#ctor
Creates a new model object selector instance.

Tekla.Structures.Model.UI.ModelObjectSelector.GetSelectedObjects
Returns an enumerator of all the selected model objects in the model view.
Returns: A model object enumerator of all the selected model objects.

Tekla.Structures.Model.UI.ModelObjectSelector.GetObjectsByBoundingBox(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Model.UI.View)
Returns an enumerator of the given view's visible model objects that collide with the given
geometrical bounding box. Note that this method uses approximate bounding
boxes and thus is NOT EXACT, and may return objects not necessarily colliding
with the given box but only being somewhere near to it.
MinPoint: The minimum point of the bounding box.
MaxPoint: The maximum point of the bounding box.
View: The view to get the objects from.
Returns:
A model object enumerator of the visible model objects colliding with the given bounding box.

Tekla.Structures.Model.UI.ModelObjectSelector.Select(System.Collections.ArrayList)
Selects a list of objects from the user interface.
ModelObjects: The list of model objects to select.
Returns: True on success.

Tekla.Structures.Model.UI.ModelObjectSelector.Select(System.Collections.ArrayList,System.Boolean)
Selects a list of objects from the user interface.
ModelObjects: The list of model objects to select.
ShowDimensions: Defines whether to show dimensions of the parts in the selection.
Returns: True on success.

Tekla.Structures.Model.UI.ModelObjectSelector.Select(System.Collections.ArrayList,System.Boolean,System.Boolean)
Selects a list of objects from the user interface.
ModelObjects: The list of model objects to select.
ShowDimensions: Defines whether to show dimensions of the parts in the selection.
SuppressCallbacks: if set to true, suppress callbacks.
Returns: True on success.

Tekla.Structures.Model.UI.ModelObjectSelector.SelectAnnotations(System.Collections.Generic.List{Tekla.Structures.Identifier})
Selects a list of objects from the user interface.
Identifiers: The list of model objects to select.
Returns: True on success.